# Operations

In [10]:
import numpy as np
import pandas as pd

In [13]:
df = pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[444,555,666,444],
    'col3':['abc','def','ghi','xyz']
})

In [14]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## To identify uniq value in column

In [20]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

### number of uniq

In [21]:
df['col2'].nunique()

3

In [22]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [23]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

## Apply functions

In [32]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [24]:
def times2(x):
    return x*2

In [28]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [29]:
df['col2'].apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [30]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [31]:
df.apply(times2)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz


### Applying python function

In [34]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [38]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

### insted of writing function at diffrant place , we can write function in one line

In [40]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64


# Remove column

In [41]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [42]:
df.drop(columns='col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

# Column and row name

In [43]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [44]:
df.index

RangeIndex(start=0, stop=4, step=1)

# Sort

In [47]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [49]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

# isnull

In [50]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# pivot table

In [56]:
data=dict(
    A=['foo','foo','foo','bar','bar','bar'],
    B=['one','one','two','two','one','one'],
    C=['x','y','x','y','x','y'],
    D=[1,3,2,5,4,1]
)

In [59]:
df=pd.DataFrame(data)

In [60]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [61]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN